app/controllers/comparisons_controller.rb

  def index
    @comparison = Comparison.create
---
INSERT INTO "comparisons" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-11-17 17:21:23.125530"], ["updated_at", "2015-11-17 17:21:23.125530"]]

  def create
    binding.pry
    picture_not_chosen = Picture.find(params[picture_id])
    picture_not_chosen.destroy
    comparison = Comparison.find(params[comparison_id])
    comparison.pictures.count
---
SELECT "pictures".* FROM "pictures" WHERE "pictures"."comparison_id" = ?  [["comparison_id", 26]]
DELETE FROM "pictures" WHERE "pictures"."id" = ?  [["id", 150]]
SELECT  "comparisons".* FROM "comparisons" WHERE "comparisons"."id" = ? LIMIT 1  [["id", 26]]
SELECT COUNT(*) FROM "pictures" WHERE "pictures"."comparison_id" = ?  [["comparison_id", 43]]