app/controllers/pictures_controller.rb

SELECT  "pictures".* FROM "pictures"  ORDER BY "pictures"."id" ASC LIMIT 1
SELECT COUNT(*) FROM "pictures"
---
  def index
    session_pics = Picture.session_pics
    @session_pics = Picture.first_two_pics(session_pics)
    Picture.next_pic(session_pics)


    if session_pics.length = 10