app/controllers/pictures_controller.rb

  def index
    comparison = Comparison.find(params[:id])
---
SELECT  "comparisons".* FROM "comparisons" WHERE "comparisons"."id" = ? LIMIT 1  [["id", 1]]