app/controllers/users_controller.rb

INSERT INTO "users" ("email_address", "created_at", "updated_at") VALUES (?, ?, ?)  [["email_address", "a@a.com"], ["created_at", "2015-11-19 00:56:20.952311"], ["updated_at", "2015-11-19 00:56:20.952311"]]
---
def create
    @user = User.new(user_params)
    respond_to do |format|
    	@user.email_address = params[:user][:email_address]
      @user.photo_url = params[:photo_url]
      if @user.save